---
kind: property
id: P:Autodesk.Revit.DB.Structure.TrussMemberInfo.memberTypeKey
source: html/87c916ca-4e5a-15a3-3aef-d0f65a796a3f.htm
---
# Autodesk.Revit.DB.Structure.TrussMemberInfo.memberTypeKey Property

Kind of the member in the truss.

## Syntax (C#)
```csharp
public TrussMemberType memberTypeKey { get; set; }
```